--[[
    ███████╗██████╗  █████╗ ███╗   ███╗███████╗██╗    ██╗ ██████╗ ██████╗ ██╗  ██╗
    ██╔════╝██╔══██╗██╔══██╗████╗ ████║██╔════╝██║    ██║██╔═══██╗██╔══██╗██║ ██╔╝
    █████╗  ██████╔╝███████║██╔████╔██║█████╗  ██║ █╗ ██║██║   ██║██████╔╝█████╔╝
    ██╔══╝  ██╔══██╗██╔══██║██║╚██╔╝██║██╔══╝  ██║███╗██║██║   ██║██╔══██╗██╔═██╗
    ██║     ██║  ██║██║  ██║██║ ╚═╝ ██║███████╗╚███╔███╔╝╚██████╔╝██║  ██║██║  ██╗
    ╚═╝     ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝ ╚══╝╚══╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝
    █████████████████████████████████████████████████████████████████████████████╗
    ╚════════════════════════════════════════════════════════════════════════════╝
                   ██████╗██╗     ██╗███████╗███╗   ██╗████████╗
                  ██╔════╝██║     ██║██╔════╝████╗  ██║╚══██╔══╝
                  ██║     ██║     ██║█████╗  ██╔██╗ ██║   ██║
                  ██║     ██║     ██║██╔══╝  ██║╚██╗██║   ██║
                  ╚██████╗███████╗██║███████╗██║ ╚████║   ██║
                   ╚═════╝╚══════╝╚═╝╚══════╝╚═╝  ╚═══╝   ╚═╝
    █████████████████████████████████████████████████████████████████████████████╗
    ╚════════════════════════════════════════════════════════════════════════════╝
]]

local FRAMEWORK_NAME = "F̷̨̡̢̧̢̡̧̧̧̡̢̢̨̡̡̡̨̢̧̨͎̭̝̯̼̮̟͖͈̩̣̞̜̬̗͔̬͔̥̰̮̯̥͓͓̱͙̗͇̼̱̮̰̩̬̙̥͈̠̲̰͖̲̱͖̳̝͕̥͕̞̞͇̣̤̬̤̲̮̻̳̰̝͇̮̗̳̣̜̠͔̦̺͍̺̮̙̺̰̤͖̞̹̞̜̼͎̟̖͖͈͎͙̺̞̰̗̯̰̙͖͎̺͎̘̩̭̜̖͍̭̗͓̤̹͚̻̤̞̳̦̳̰͖̮͚̬͔͙̺̪̠̳͍̣̜̝͖̲͔̠̫̝̰̖̗̭͙̫̰̳̹͖̦̠͎̳̠͓̹̭̞̱͇̤̜̙̭͉̫͚̬̙͓̱̺̜̹͔̗̟̲͓̠̬̣̺͇̤̩̯͕̮̠̘̖͕̪̮̹̜̰͔͈͔̦̹̦̣̺̗͈̣̳̣̭̳̩̺̠͈͕̹͓̠͇̮̮̟̟̘̝̝̯̩̹̬̮̯͎̠͈̼͉̲̗̦͙͉̝͇̭̭̳̖͚̫̩̘͋̍̍̈́̄̑̈̽̐̓̎̋͜͜͜͜͜͜͝ͅͅͅŔ̴̢̧̧̨̧̧̢̢̛̛̛̛͈̼͎̝̦͇͔̮̩̳̪̗̬͎̬̤̫̻̭̮̰̜̗̥̘̪̩̲̝̝̣̬͙̮͓͓̰͓͉̤̳͖̥̘̯̜͍̥̮̲̞̲̝͎̲͚͇̮̲̫̹͔̟͔̤̘̯͔̣̣͉̹͚̭̗̮̝̩̞̥̹̭̝͎̠͔̹̰̜̯̳̻̤̳͓͎̫͙͍̗͈̻͙͍̭͇̰͍̭͍̪͙̥̬̞̟̣̞̫̻̗̭͈͍̹͖͕̌̏̌̔̋͂̈́̎̂͑̓͊́̔͐̆̄̔̈́̀̿̾̋̈́̉̉͆͂̈́̅͂͂̋͗͂͂͛̍̐̅͆̂̽͑̋́͆̑̎̈́̒̈́̍́̈́̇̓͂̾̄͋̐̿̑͛͗̄̑͂̈́̿̅̀̓̀̈́͒̅̑̒͛̈̔̍̾̉̐͌̀̏̀̀͗͛̈̑̔̍͌͌̓̆͑̊͆̂̈͐͐̿͂̿̏̀̌̊̀̉̇͋͗̇́͐̋͑̇́̆́̒̔̓̑̇̈̓̈́͌̌̐̇̽̓̐̔́̉͆̑̍͑̏̾̍̄̏͆̓̈̑̽̽̉͐̓̅̃́̌̅͗̋̊͛̈́͌̾̀̈́̉̈́̑͆̉̒̒̿̌̊͑̽̐͋͑̂̉͊͋͋̐̌̀̎̐̿͐̈̃̐̄̚̕̕̕̚͘͘͘͘͘͜͜͠͝͠͝͝͝͝͝͝͠͝͝͠͝͝͝͝ͅͅͅͅÁ̷̡̧̧̨̧̧̧̢̧̨̡̡̢̡̨̧̧̨̨̧̨̢̡̛̛̛̛̲̬̲̟̱̳̳͈͇͚͚̦̹̖̪̳̮͉̭̠͈̦͕̝͎̫͉̯̣̥̦̹̦̝̩̝̼͉͎͈̦̗͉̭̦̗̹̭̦͔͙͉͖̰͖̯̜͙̣͔̘͉̗͖̻͓̠̤͙̩͈̲̙̠̮̹̦̹͙̖̹̲͈̜̺̯͓̘͔̗̝̥͔̟̳͍̥͎̰͓̜̜͈̦̣̱͙̭͍͙̝̩̲͙̣̹̩̠̬͍͙̻̯̥̙̮͎͎̖̲͙͉̯̰̤͖͚͚͕̫̞̰̫̥̮͓̞̟̲͍͔̙̟̥̳̮͓͍̻̻̜̹̼̘̮̙̜̬̦̰̦͕̱̘̳̰͔̤̞̱̜͖̣̮͍̞̯̮̹̝̘͇͎̥̤̲̖͈͓͇̜͚̤͙͔͚̬̘͇̼̘̣͎͓͇͙̼͈̯̜̟͍̠̤̣͇͙͙̻́̈́̀̌͌̀̃͊̓͆̔̈́̈́̽̑̍̈̂͊̾͋̃̇̎̓́̓̋́͗̎̃̆͆́̀͐̅̿̋̅̃͂̿̐̓͆̇̀̈̌̾̋̌̒̓̔̌̌̇͋̔͐̿́̽͌̒̌̏̽̓͑̒̇͌͌̀͌̑̆̑̈́̏͛̀̾̈̑͒̓͋̊̔̈́̄̋͗͌̅̏̓̐̆̍̽͌̾͋̒̀͋̀̑̑̃̾̏͗͋̅̏̆̓̈́̀̃̆̔͐̏͑́̽͛̍͂͛̄͂̂̃̀̂͊͌̈́͊̃͛͑̐͌̔̒̒̾͛̍̀̅̈́̐̓̈͊͒̆̂͌͆́̊̃̑́̈́̏̏͗̊͊̿̿̑͌̅̉̾͐̒̀͒̃͐̊̌͑̂̈̅̊͑̉̏͑̍̊̽̿͐̍̂̈́̌̀͐͂̅̓̉̀͐͊͆̄̄́̾͊̀̇͋̓͂̑͒̓̕͘̚͘̚̕̚̕̕̚͘͘̚͘͘̕͘͘͜͜͜͜͜͜͝͠͝͠͝͠͝͝͝͠͝͝͝͝͝͝͠ͅͅͅM̶̢̧̨̢̨̧̢̡̨̢̢̛̛̛̛̛͔̳͇͔̝̰̮̗̱͈̩̖̮̬̙̰̹͔̪̺̖̤̥̜̲͈̣̙̱̘̣̥̼̼̯̬͍͍̖̤͖͔̪͙̝̖͎̯͎͕̹̦͎͇͍͓̩̫̞̗͍͔͔͓̙̣̰͎͉̞̬͕̠̞̪͉̺͎̺̭̻͖̬̹̰̜̱̰̺̻̖͚̖͓̩̫͉͕̝͕͔͚͉̥̲͚̦̪̮̖̺̺̼͉̦̱̮͔̖͎̗͖̦͔̼͔̫͚͔̲̼̻̀̃̋̈̇̈́̒̽͌̓̔͐̉̌̏͆̈̔͌̉̀̈́͒̋͛̈́̈́́̆̎́̾̈͋͊͂͂̓̉̉̎̽̽͛͊͐͆̂̿̇̇̌̀̌̒̎̓̿̆̀͗̑̾́̀̔̈́̈́̄͊͑̊̍̎͗̆̏͌̄͋̉̌̀͗̂̆̑̅̈́͗̈́͗̾̈́̔͌̂͛͐͛͗̋̂̐͊̓̓̒̑͒̈́͊͑̐͛͒̃̔͛͊͗̌̽̈̔̏͑͒͆̎̎̆̉̈́̀̉̀͒̋̈́̉̃̏̋́̒͗̓͛̍̍̃͐͑̇̋̄̅͌̅̐̓̎̀̋͌́͑̾̿͑̀͌̎̊͊͛̒̓́́̎͂͒͌̈̎̄͒͊́̂͌̓͗̑̈́͘̚̕̕͘̕͜͜͜͝͝͝͝͝͠͝͝͝͝͝͝͝͝͝͝͠͝͝ͅͅͅĖ̸̢̧̢̨̧̨̢̨̧̡̢̧̨̨̧̨̛̛͖̮̤̳͈̞̰̠̳̼̪̺̥̭̰̜͓͙̜̥̭̦̜̭̞̱̺̬̯̲͖̝͙͓̮̲̬͔̺͉͚̜̰̝̝̲̼͉̼̼̪̙̬͕͉̻̯̪̜͚͚̟̜̗͚̙͖̥̥̻̭͕̳̜͈̠̥̠͎̝̱͖͚̳͍̳̻̣̥̫͔̖̜̜̩̟͈̬͛̽̇̎̇͋͌̐͋̽̆̊̌̅̾̇̿̄̈̋̓̅͑̂̌̐͊̑͆̃̉͊͒͛͛͆͂̀͋͑͊̆͆̃̍̋̀̎͆̈́̒̔͗́̆̓̆̓̏̈̾̓̈̌͐̀͌̿̉̓͂̅̂̐̇̃͗̈́̊̔̔̈̈́̃̉̅̀̎̐̏͑̋̇̔̀̋̉̈̐̾̀̄͛̑̊̏̀̽̉̂̆̈́͛̓̆́̿̿̽̆͊̓͂͒́̎̉̅͌̔̄̋̀̌́̉̏͋͑̀̾̋̃̉̈́̏͐̿̏̇͊̾̄͗̊̌̽̽̈́̐́̂̄́͛̄̇̎̆̂̊̚͘̕͘̚̚͘̚̕̕̚͘̚̕̕̕̕̚͜͜͜͝͠͝͠͠͝͠͝͝͠͝͠͠͝͝͝͠ͅͅͅͅW̸̡̡̧̢̢̛̛̛̭͍͔̰̮̠̮̮̖̼̣͖͍̪͉̝͉͓͉̼͙̖̫̙͉̠̩̼͍̰̻̦͉͖͍̬͙̫̼͓̻̮̝̜͇̲͕͔̮̭̪̝͔̮͙̟̘̤̭͓͖̩̰̮̹̌̂̇͂̑̒̒̍̆͛̀̇̿͗́̂̅̀̓̓͛̒̇̌̉̃̅͛̂̀̽̆̓̆̈́̎͑̓̏̽̽͒̏̅͆͗͐͗͋̀͌͋̏̑́̍͋̍̆̔̒͆͆͛̅̇̑͆̈̂̑̃̓̽͋̈̔͑̌̈́̉̑͆̈́̃͐̓͐͌̓̐̈́̓̂̾̽̌̆͊͗̿͂̒̽̉͛̀̈͑̃̉̔̃͛̈́̑̀̏͑͊̂̄̈́͂̇͗̊́͗̒͗̏̇̿͌̃̃̓͂̿͗̉̑͊̆̋͛͋͒̋͛͂̔͗͗̇͛́͂̈͋͊̅̽͑͆́͊̽͂̔́̆̊̀͗̿̍̿́̑͐͑́͑͋͗́̐̅̈́̏͑̃̏̍̀̆͆͊̍̈́̓̍̓̎̎̃̀́̋́̽̋̿̔̈́͗́́̂̈̒̌̆̈́̀̓̓̅͆͗̀̓̔̄̄́͋̾͑̌̇̒̑̃̈́̉͑̊̀̈́̊̕̕̕̕̚͘͘̕͘̚̕͘͘͘͘͜͝͠͝͝͝͝͠͝͠͝͝͝͝͝͝͝͠͝͠͠͠͝ͅͅǪ̶̡̨̧̢̡̢̡̡̨̢̧̢̢̡̡̧̨̢̡̛̛̛̛̛̛͙̥̥̼̝͔̟̟̤̮̼̠̜̫͔̼̘̤͈̮̲̼̙̫͓̮̪͎̥̙̫̙̭̹̲̹̲̦̥̦̮̣̰̫̝̻͕͓͍̬̲̳̪̤͇̼͙͈̳̯̻̲̺̰̖̗̺̜̱̣̬̭̱͉͓̭̥̖̗͚̗̝̙͈̪̲͚̥̠̠̥͚̞̙͔̭͈̫̲̬̳͕͙̠͈͈̪̗̭͕͙͓͍̦̬͓̤̮̩̝̜͈͉͍̜̺̤̪̗̝̟̪̻̲͖̻̗̗̮͈̪͙̖̭̻͔͙̣̺̳̮̙͔̗̮̘̜̦̬̣̣̲̣̗̞͇̺̞̫̥̯̱̩͖̘͉̬͙̥̤̝̰̜͙̱̠͔̺̳͎̙̹̖̱̣͈̘̳̭̞̘̤̗̝͍̼̠̫̦̒͛̊̊̌̌̈́̏͆̄̂̏́͑̄͆͑̈́̂̍͆̇͌́̋̀̅̐̀̈̇͋̂̈̌͋͑̐͒̒͌̓̋̆̌͌̉̆̏̓͋̐̈́͗̽̋͑̉͋̉͆͒͐̿̉̒̆͂͒̃́̈́͋͌̇̅̽̂̏̈́̀̔͆̋̽̔̏̋̓̈́̊̉̎͑̓͌̉̀̆͌͋̊̊̄̓͆̏͐̐̇̔̑͂̎͑̔̈́̌̓̇̉̔͐͑̓̓̇̈́̕͘̚̕̕̚̚͘̕͘͜͜͜͜͜͜͜͜͜͠͝͠͠͝͠͝͠͝͝͝͝͠ͅͅͅR̵̡̨̡̡̢̡̨̡̨̨̧̢̢̢̧̨̢̨̨̧̛̛̠̺̻̱̤̖̻̲̝̣͕̜͎͓͕̼͈̥̦͕̦̦̺͇̱̜̗͔͍̪̭̝̰̫̳͎͓̦͖̩͚̮̗̱̝͇͚̲͙͔͈͉̦̮̦̙͎͕̳̩̩͓̣͔̰̻͖͔͍̹̟͚̩̼̥̬͕̫̖͕̣͙̳̦̼̮̙̲͍̘̣͙͍̰̳͙͈̫̭̗̫̮̥̱̩͎̣̬̣̩̙͈͎̯̥̘̦̝̤̹̟̩̯̺͙̭̗̱͓͖̮̖̘͕͉̤̹̜̲̤̜̯̭͖̘͕͔̮̣̘̮̲̀͑͑̍́̾͌̀̋̽̃̊́̿̽̀͂̓̃̀̋̈́̈̌͑̈̅̑̂̿̓̌͌̅̈̔͐͂̑͛͒̆̓̃̋͗̂̒̽͗͒͊͂̾̀͌̄́̒͂̇́̌̽̈́̒͒̓͋̀̉̍̇́͒̎͑̋͆̑̔̔̒̍͑͐̂͆̽̓͐̋͋͊̏̌̋̊͋̒̓͊̒̾̀̏̓̐̄͐̃̉͂̀̌̿̓̐̔̈͑̈́͑̀͗͒̇͆͊̈́̾̌̀̾̎̃̋̇̆̋̈́̋̆̈́̎̎̇̿́̆͛̃̊̓̇̑̋͆͂̀̑͂̑̇͋͒̉͒̂̏̈́̀̉̋͒̂̒̆͒̃̈́͒̎͛̌̃̽͂͒̅̔͗̒̃̂̾̇͒̓̓̈́̌̆̊̎̂̏͐̎̊̔̀͐̈́͗̾̂̽͛̋̌̐̍̄͊̇̂̈́̏́́̑̿͗̈́̍̉͗́̐̑̄́̀̀̿̐̒̓̆͘͘̕̕̚̚͘͘̚̕̕͘͘͘͘͘̚̕̕͜͜͜͜͠͝͠͝͠͠͝͝͝͝͝͠͠͝͝͠͠͝͠͝͝͝ͅͅͅͅK̵̛̳͗́̈͌͋̅̓̂̂͋̈̄̄͂̿̐͊̆͐̿̓̄̇̈̈́͆̌̏́́̽͐̏̿̅̎̂̚̕̚̕͝͠͠"

local ReplicatedStorage = game:GetService("ReplicatedStorage")
local Players = game:GetService("Players")
local SERVER = ReplicatedStorage:WaitForChild("F_A_E_O_K")
SERVER.Name = FRAMEWORK_NAME

local MapFolder = Instance.new("Folder")
MapFolder.Parent = game.Workspace
MapFolder.Name = FRAMEWORK_NAME

SERVER.OnClientEvent:Connect(function(data)
    if typeof(data) == "string" then
        if data == "Disconnect" then
            for _,v in ipairs(MapFolder:GetChildren()) do
                v.Parent = ReplicatedStorage.Framework
            end
        end
    else
        for _,v in ipairs(Players:GetPlayers()) do
            
        end
    end
end)